Repository: gitGNU/gnu_linterna-magica
Catalog: po/*.po
Languages: bg

source: version:
bg: версия:

source: Translation
bg: Превод

source: Linterna M\u00e1gica Home page
bg: Уеб страница на Linterna M\u00e1gica

source: Linterna M\u00e1gica project page at Savannah
bg: Страница на проекта Linterna M\u00e1gica в Savannah

source: Report a bug at our Savannah project page
bg: Подайте доклад за грешка на страницата на проекта в Savannah

source: Microblog notices about Linterna M\u00e1gica at Identi.ca
bg: Бележки в Identi.ca относно Linterna M\u00e1gica

source: Chat rooms
bg: Стаи са разговори

source: at
bg: в

source: New version
bg: Нова версия

source: Date
bg: Дата

source: Update
bg: Обновление

source: New version is available.
bg: Налична е нова версия.

source: released at
bg: публикувана на

source: Read the news section at the home page
bg: Прочетете новините на уеб страницата

source: Remove update notifier
bg: Премахване на обекта

source: Watch video on the web
bg: Гледайте уеб видео клипове

source: in a brand new way:
bg: по напълно нов начин:

source: You don't need a glint,
bg: Нямате нужда от проблясъци,

source: the magic lantern is ignited!
bg: вълшебният фенер е разпален!

source: This program is free software;
bg: Тази програма е свободен софтуер.

source: you can redistribute it and/or
bg: Можете да я разпространявате и/или

source: modify it under the terms of the
bg: променяте под условията на

source: GNU General Public License (GNU GPL)
bg: Общия публичен лиценз на GNU (GNU GPL)

source: version 3 (or later).
bg: — версия 3 на лиценза или по-късна.

source: A copy of the license can be downloaded from
bg: Копие на лиценза можете да изтеглите от

source: Jan
bg: яну

source: Feb
bg: фев

source: Mar
bg: мар

source: Apr
bg: апр

source: May
bg: май

source: Jun
bg: юни

source: Jul
bg: юли

source: Aug
bg: авг

source: Sep
bg: сеп

source: Oct
bg: окт

source: Noe
bg: ное

source: Dec
bg: дек

source: __translators
bg: Ивайло Вълков <ivaylo@e-valkov.org>

source: __direction
bg: ltr

source: Loading video...
bg: Зареждане на клипа…

source: Waiting for video plugin to load ...
bg: Изчакване на приставката за видео клипове да зареди…

source: It seems that the page is serving mixed
bg: Изглежда, че страницата изпраща смесено

source: content and Linterna M\u00e1gica
bg: съдържание и Linterna M\u00e1gica

source: might not be able to play the video, because
bg: не може да изпълни това видео, заради

source: of mixed content blocking.
bg: блокирането на такова съдържание.

source: Read about mixed content blocking in Firefox (forks and clones as well)
bg: Прочетете за блокирането на смесено съдържание във Firefox (и производни)

source: Check out the Toggle Mixed Active Content addon
bg: Разгледайте приставката Toggle Mixed Active Content

source: View the page without encryption on your own risk
bg: На своя отговорност посетете страницата без шифриране.

source: It seems that the signatures for this
bg: Изглежда, че ключовете за този клип

source: video are encrypted or missing.
bg: са шифрирани или липсват.

source: Linterna M\u00e1gica is not able to play such clips.
bg: Linterna M\u00e1gica не може да изпълнява такива клипове.

source: Sorry for the inconvenience.
bg: Съжаляваме за неудобството.

source: Read the bug report about encrypted signatures
bg: Прочетете доклада за грешка относно шифрираните ключове.

source: Watch this video at it's original site with Linterna Mágica
bg: Гледайте този видео клип на неговата уеб страница с Linterna Mágica

source: Remove this button, if it overlaps images or text in the page.
bg: Премахнете този бутон, ако скрива изображения или текст от страницата.

source: Link
bg: Връза

source: HQ
bg: ВК

source: Higher quality
bg: Високо качество

source: Download
bg: Запазване

source: Save the video clip
bg: Запазване на видео клипа

source: About
bg: Относно

source: Play
bg: Изпълнение

source: Pause
bg: Пауза

source: Time
bg: Време

source: Volume control
bg: Сила на звука

source: Volume
bg: Сила на звука

source: Mute
bg: Заглушаване

source: Unmute
bg: Премахване на заглушаването

source: Muted
bg: Заглушен

source: Fullscreen
bg: На цял екран

source: Switch between site's HTML5 player and Linterna Mágica
bg: Превключване между възпрозивеждане чрез HTML5, предоставено от страницата и Linterna Mágica

source: Double-click to change the size
bg: Натиснете да пъти, за да промените размера

source: Click to change the size
bg: Натиснете, за да промените размера

source: Linterna Mágica error and debug messages
bg: Съобщения за отстраняване на грешки в Linterna Mágica

source: Hide debug messages
bg: Скриване на съобщенията за отстраняване на грешки

source: Ctrl+double-click to select all messages
bg: Натиснете два пъти с мишката докато държите клавиша Ctrl, за да изберете всички съобщения

source: Debug messages
bg: Отстраняване на грешки

source: Remove log
bg: Премахване на обекта

source: Loading
bg: Зареждане

source: Buffering
bg: Буфериране

source: Waiting plugin
bg: Изчакване на приставката

source: Low
bg: Ниско

source: High
bg: Високо

source: RTSP link
bg: Връзка тип „RTSP“

source: Progressive link
bg: Връзка тип „Progressive“

source: Unkown container
bg: Непознат контейнер

source: Unkown encoding
bg: Непознато кодиране
