Repository: gitGNU/gnu_linterna-magica
Catalog: doc/po/*.po
Languages: bg

source: First the cookies are removed by setting their expiration dates in the past. A request on the background (XMLHttpRequest) for the video page (for example watch?v=x) is made. The required data is extracted and the replacement video object is created. Cookies values can be saved before the request and restored later, but not their original expiration dates. Restored cookies will expire when the browser is closed. This hack might break login/favourites/recently watched and other features for sites supported this way. The browser will automatically set new values to some of the cookies with the background request.
bg: Първо бисквитките се премахват като им се задават дати за валидност в миналото. Прави се заявка на заден план (XMLHttpRequest) за страницата с видео клипа (например watch?v=x). Извличат се необходимите данни и се създава заместващ обект за възпроизвеждане на видео. Стойностите на бисквитките могат да бъдат извлечени преди заявката и след това да бъдат възстановени, но не и първоначалните им дати за валидност. Възстановените бисквитки ще загубят валидност при затваряне на браузъра. Решение може да повреди някои функционалности в поддържаните по този начин страници. Например вход/любими клипове/скоро преглеждани и др. Браузърът автоматично ще зададе нови стойности на някои от бисквитките чрез заявката на заден план.

source: Timed-out background requests
bg: Забавяне на заявките на заден план

source: timeout, xhr
bg: забавяне, xhr

source: delay
bg: закъснение

source: XHR, delay
bg: XHR, закъснение

source: background request
bg: заявка на заден план

source: For Dailymotion you could use a timeout option. During the first tests of this fix there were some problems if the background request was made too soon. It seemed that not all cookies were set by the site and cleared by Linterna M@value{AACUTE}gica before the request. Later everything worked without timeout. If you have problems with Dailymotion increase the value for the ``wait_xhr'' option.
bg: За Dailymotion може да настроите време за изчакване. Докато се изпробваше това решение на страницата, се появяваха проблеми, когато заявката на заден план се осъществяваше прекалено рано. Изглежда, че от страницата не се записваха всички бисквитки и съответно не се изчистваха от Linterna Mágica преди заявката. По-късно решението работеше без изчакване. Ако имате проблеми с Dailymotion, увеличете стойността на „wait_xhr“.

source: The wait_xhr option is effective for every site that is supported with background requests.
bg: Настройката „wait_xhr“ важи за всяка страница, която се поддържа чрез заявки на заден план.

source: Localisation
bg: Превод на интерфейса

source: localisation
bg: превод на интерфейса

source: In version 0.0.10 translations were split from the main userscript. Every localisation was a separate userscript with special structure. In version 0.0.11 userscript files are automatically generated form PO files. If there is translation for your language and you want to use it, you will have to build and install it. Compiled userscripts are also available at Linterna M@value{AACUTE}gica website.
bg: Във версия 0.0.10 низовете с превод на интерфейса бяха разделени от основния потребителски скрипт в самостоятелни файлове. Преводите бяха отделни потребителски скриптове със специална структура. Във версия 0.0.11 файловете с потребителските скриптове се създават автоматично от PO файлове. Ако съществува превод за Вашия език и желаете да го използвате, трябва да го компилирате и инсталирате. Компилирани потребителски скриптове може да намерите и на уеб страницата на Linterna M@value{AACUTE}gica.

source: By default Linterna M@value{AACUTE}gica tries to use the language of the browser interface if available. You could also set a custom locale by the ``locale'' config option.
bg: Стандартно Linterna M@value{AACUTE}gica се опитва да използва езика на интерфейса на браузъра, ако преводът е наличен. Също така, можете да използвате превод по Ваш избор, чрез настройката „locale“.

source: To build all the localisation userscripts in the top source directory type:
bg: За да компилирате всички потребителски скриптове с преводи, в папката с изходния код въведете:

source: You could also build the scripts from the @file{po} directory:
bg: Също така, можете да компилирате скриптовете от папката @file{po}:

source: Compilation of userscript for single language is possible. To do so, type:
bg: Компилиране на потребителски скрипт само за един език също е възможно. За да го направите въведете:

source: Replace @var{langcode} in the example above with the code of the desired supported language.
bg: Заменете @var{langcode} в горния пример с кода на желания поддържан език.

source: exclude site
bg: изключване на уеб страница

source: include site
bg: включване на уеб страница

source: stop execution on specific site
bg: спиране на изпълнението на определена уеб страница

source: By default Linterna M@value{AACUTE}gica will run on every site. This is something that you might not like. You can configure it to run only on some pages. Open the source file and look for @code{// @@include http://*}. Remove this and place the same statement for every site you wish to use Linterna M@value{AACUTE}gica with:
bg: Стандартно Linterna Mágica се изпълнява на всяка страница. Възможно е тази функционалност да не ви харесва. Можете да настроите програмата да се изпълнява само на някои страници. Отворете файла с изходния код, и търсете за @code{// @@include http://*}. Премахнете този ред и добавете подобен фрагмент за всяка страница, на която искате да използвате Linterna Mágica:

source: support
bg: поддържани

source: Linterna M@value{AACUTE}gica explicitly supports only free software browsers and plugins.
bg: В Linterna M@value{AACUTE}gica се поддържат само браузъри и приставки, които са свободен софтуер.

source: Supported browsers::
bg: Поддържани браузъри::

source: Supported plugins::
bg: Поддържани приставки::

source: Supported websites::
bg: Поддържани уеб страници::

source: Not supported
bg: Какво не се поддържа?

source: Supported browsers
bg: Поддържани браузъри

source: browser list
bg: браузъри, списък

source: supported browsers
bg: поддържани браузъри

source: browsers
bg: браузъри

source: Epiphany, browser
bg: Epiphany, браузър

source: IceCat, browser
bg: IceCat, браузър

source: GNU IceCat, browser
bg: GNU IceCat, браузър

source: Iceweasel, browser
bg: Iceweasel, браузър

source: Web browser, browser
bg: Web browser, браузър

source: Abrowser, browser
bg: Abrowser, браузър

source: Firefox, browser
bg: Firefox, браузър

source: Midori, browser
bg: Midori, браузър

source: In this release (@value{VERSION}) Linterna M@value{AACUTE}gica is tested and kept up to date with the following browsers:
bg: В тази версия (@value{VERSION}) на Linterna Mágica са изпробвани и се поддържат следните браузъри:

source: Epiphany versions older than 2.30 might have problems with Greasemonkey.
bg: Възможно е версиите на Epiphany по-стари от 2.30 да имат проблеми с Greasemonkey.

source: Free software versions of Firefox
bg: Свободни версии на Firefox

source: Free software versions of Firefox that support the Greasemonkey extension should work. Only GNU IceCat, Web Browser/ABrowser and Iceweasel are tested.
bg: Версии на Firefox, които са свободен софтуер и поддържат разширението Greasemonkey, би трябвало да работят. Изпробвани са само GNU IceCat, Web Browser/ABrowser и Iceweasel.

source: Only versions 0.2.2 and 0.2.4 are tested. There are reports from users that 0.3.2 works too.
bg: Изпробвани са само версии 0.2.2 и 0.2.4. Има потвърждение от потребители, че 0.3.2 също работи.

source: Supported plugins
bg: Поддържани приставки

source: plugin list
bg: приставки, списък

source: supported plugin
bg: поддържани приставки

source: plugins
bg: приставки

source: Xine, plugin
bg: Xine, приставка

source: Totem, plugin
bg: Totem, приставка

source: VLC, plugin
bg: VLC, приставка

source: gecko-mediaplayer, plugin
bg: gecko-mediaplayer, приставка

source: Supported video plugins that can handle "video/flv" and "video/mp4" should work right away. Some plugins provide an API which is used in Linterna M@value{AACUTE}gica to support web controls, but this will require modifications to the code, if the plugin is not listed as supported. There is a configuration option to switch between controls provided by the plugin and Linterna M@value{AACUTE}gica.
bg: Приставки за видео клипове, които поддържат „video/flv“ и „video/mp4“, би трябвало да работят без проблем. Някои приставки предоставят програмен интерфейс, който се използва в Linterna Mágica, за бутони за управление на видео клипа. Тази функционалност изисква промяна на изходния код, ако приставката не e обявена като поддържана. Възможно е да настроите какви бутоните ще използвате – от приставката или от Linterna Mágica.

source: These plugins are known to work:
bg: Linterna Mágica е изпробвана и работи със следните приставки:

source: Totem plugin
bg: Totem

source: Versions older and equal to 2.30 does not have full API support for web controls. Newer versions of Totem have been patched and should work.
bg: Версии по-стари и равни на 2.30 нямат пълен програмен интерфейс за бутони за управление на клипа. По-новите версии са поправени и би трябвало да работят.

source: VLC plugin
bg: VLC

source: No known problems.
bg: Не са известни проблеми с тази приставка.

source: gecko-mediaplayer plugin
bg: gecko-mediaplayer

source: Note: Have in mind that gecko-mediaplayer depends on mplayer for playback. Mplayer is free software by itself, but it can load and recommends binary only codecs. The completely free (as in freedom) distribution of GNU/Linux, Trisquel provides clean version of mplayer.
bg: Бележка: Имайте предвид, че gecko-mediaplayer зависи от mplayer за изпълнение на видео клипове. Програмата mplayer е свободен софтуер, но може да зарежда и препоръчва кодери, които не са свободен софтуер. Напълно свободната (като в свобода на словото) дистрибуция на GNU/Linux, Trisquel предоставя изчистена версия на mplayer.

source: Xine plugin
bg: Xine

source: Supported websites
bg: Поддържани уеб страници

source: supported websites
bg: поддържани уеб страници

source: websites
bg: уеб страници

source: Linterna M@value{AACUTE}gica is programmed in such a way that it might work (and it does) with web sites not specifically tested and supported. This is achieved by regular expressions, patterns and similarities between video sharing and posting sites. The main idea is that very little should be needed to support a new site - few changes in a regular expression, adding an address from where the clip should be extracted and so on.
bg: Linterna Mágica е програмирана по такъв начин, че е възможно да работи (и наистина го прави) със страници, които не са специално тествани и поддържани. Това се постига чрез регулярни изрази, шаблони и прилики между страниците за споделяне и публикуване на видео клипове. Основната идея е да е необходима незначителна промяна в изходния код, за да се поддържа нова страница – промени по регулярен израз, добавяне на адрес, от който да се извлече видео клипа и т.н.

source: There are more than 30 web sites, found with random web searches that are known to work. See the @file{WEBSITES} file for all known working sites and more information.
bg: Съществуват повече от 30 уеб страници, намерени чрез произволни търсения в Интернет, за които е известно, че работят. Във файла @file{WEBSITES}, може да видите всички известни работещи страници и по-подробна информация.

source: not supported
bg: неподдържани

source: proprietary software, not supported
bg: собственически софтуер, не се поддържа

source: Web sites that use RTMP to transfer clips @strong{do not} work.
bg: Уеб страници, които използват RTMP за предаване на видео клиповете @strong{не} работят.

source: Web sites that use clips and players from remote site @strong{do not} work. For example YouTube video placed in a blog or a news article. Since version 0.0.9 some remote objects are detected and a link to the web page of the video is provided.
bg: Уеб страници, които използват видео клипове от отдалечени страници @strong{не} работят. Например видео клип от YouTube поставен в блогове или в страници с новини. От версия 0.0.9 някои обекти от отдалечени стачници могат да бъдат разпознати. За тях се предоставя връзка към уеб страницата с видео клипа.

source: Linterna M@value{AACUTE}gica is not working with specific browser or plugin or operating system. Is it possible to support it?
bg: Определен браузър, операционна система или приставка за видео клипове не работи с Linterna Mágica. Възможно ли е да бъдат поддържани?

source: Only free software will be supported. Explicit support for non-free software will not be provided. If Linterna M@value{AACUTE}gica is working with non-free software you must be very ``lucky''. Yes, that is sarcasm!
bg: Единствено свободен_софтуер ще бъде поддържан. Изрична съвместимост за несвободен софтуер няма да бъде предоставяна. Ако Linterna Mágica работи с несвободни програми, Вие сигурно сте голям „късметлия“. Да, това е сарказъм!

source: bugs, reporting
bg: грешки, докладване

source: reporting bugs
bg: докладване на грешки

source: If you encounter bugs, or have suggestions of any kind, please report them at Linterna M@value{AACUTE}gica project page at Savannah @url{https://savannah.nongnu.org/support/?group=linterna-magica}. Use the ``Tech Support Manager''/''Support'' section. The ``Bugs'' tracker is for developers only.
bg: Ако откриете грешки или имате предложения, докладвайте ги на страницата на Linterna M@value{AACUTE}gica в Savannah @url{https://savannah.nongnu.org/support/?group=linterna-magica}. За целта използвайте „Tech Support Manager“/„Support“. Разделът „Bugs“ е само за разработчици.

source: copying, copying this manual
bg: копиране, разпространение на това ръководство

source: license, license of this manual
bg: лиценз, лиценз на ръководството

source: gpl, license
bg: gpl, лиценз

source: fdl, license
bg: fdl, лиценз
