Repository: gitGNU/gnu_linterna-magica
Catalog: doc/po/*.po
Languages: bg

source: @documentlanguage en
bg: @documentlanguage bg

source: This manual (updated @value{UPDATED}) is for Linterna M@value{AACUTE}gica (version @value{VERSION}), a userscript for watching web video clips inside a browser without the proprietary flash technology.@*
bg: Това ръководство (обновено на @value{UPDATED}) е за версия @value{VERSION} на Linterna M@value{AACUTE}gica, потребителски скрипт за гледане на уеб видео клипове чрез уеб браузър без собственическата технология flash.

source: @b{@i{Watch video on the web in a brand new way: ``You don't need a glint, the magic lantern is ignited!''}}@*
bg: @b{@i{Гледайте уеб видео клипове по напълно нов начин: „Не се нуждаете от проблясъци, вълшебният фенер е разпален!“}}@*

source: Copyright @copyright{} 2010, 2011, 2012 Ivaylo Valkov <@email{ivaylo@@e-valkov.org}>@*
bg: Авторски права @copyright{} 2010, 2011, 2012 Ивайло Вълков <@email{ivaylo@@e-valkov.org}>@*

source: Copyright @copyright{} 2010 Anton Katsarov <@email{anton@@katsarov.org}>@*
bg: Авторски права @copyright{} 2010 Антон Кацаров <@email{anton@@katsarov.org}>@*

source: Permission is granted to copy, distribute and/or modify this document under the terms of either@*
bg: Получавате разрешение да копирате, разпространявате и/или променяте този документ съгласно условията на всеки от следните лицензи:@*

source: the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version, or
bg: Общият публичен лиценз на GNU (GNU GPL), както е публикуван от Фондацията за свободен софтуер – версия 3 на лиценза (или по ваше решение) по-късна версия, или

source: the @acronym{GNU} Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts.
bg: Лицензът за свободна документация на GNU (GNU FDL), версия 1.3 или всяка следваща версия издадена от Фондацията за свободен софтуер; без „Непроменливи раздели“, „Текстове на предната корица“, както и Текстове на задната корица“.

source: Copies of the licenses are included in the sections entitled ``@acronym{GNU} General Public License'' and ``@acronym{GNU} Free Documentation License'' respectively.
bg: Копия на лицензите са включени в разделите озаглавени „@acronym{GNU} General Public License“ и „@acronym{GNU} Free Documentation License“.

source: A userscript for watching web video clips without the proprietary flash technology.
bg: Потребителски скрипт за гледане на уеб видео клипове без собственическата технология flash.

source: Watch video on the web in a brand new way: ``You don't need a glint, the magic lantern is ignited!''
bg: Гледайте уеб видео клипове по напълно нов начин: „Не се нуждаете от проблясъци, вълшебният фенер е разпален!“

source: by Ivaylo Valkov and Anton Katsarov
bg: от Ивайло Вълков и Антон Кацаров

source: Introduction
bg: Въведение

source: Overview of Linterna M@value{AACUTE}gica.
bg: Преглед на Linterna M@value{AACUTE}gica.

source: Installation and building
bg: Инсталация и компилиране

source: How to build and install.
bg: Начини на компилиране и инсталация.

source: Configuration
bg: Настройки

source: Customizations.
bg: Потребителски настройки.

source: What is supported?
bg: Какво се поддържа?

source: (Not) Supported browsers, plugins etc.
bg: (Не) Поддържани браузъри, пристави и т.н.

source: Bugs
bg: Грешки

source: How to report bugs.
bg: Докладване на грешки.

source: Copying this manual
bg: Копиране и разпространение на това ръководство

source: Index
bg: Индекс

source: Introduction to Linterna M@value{AACUTE}gica
bg: Въведение в Linterna M@value{AACUTE}gica

source: What is Linterna M@value{AACUTE}gica?::
bg: Какво е Linterna M@value{AACUTE}gica?::

source: Why it exists?::
bg: Защо съществува?::

source: Who made it?::
bg: Кои са авторите?::

source: How to pronounce Linterna M@value{AACUTE}gica?
bg: Как се произнася Linterna Mágica?

source: What is Linterna M@value{AACUTE}gica?
bg: Какво е Linterna M@value{AACUTE}gica?

source: linterna m@value{AACUTE}gica, what is
bg: linterna m@value{AACUTE}gica, какво е

source: userscript
bg: потребителски скрипт

source: how it works
bg: как работи

source: Linterna M@value{AACUTE}gica is ``tiny'' (at least it started that way) script written in JavaScript for the Greasemonkey extension. It searches web pages for flash objects with links to video clips and replaces them with <object> tag that is playable by browser video plugin. The program is named after an early version of a projection apparatus.
bg: Linterna Mágica е „малък“ (поне започна като такъв) скрипт, написан на езика JavaScript за разширението Greasemonkey. Задачата му е да претърсва уеб страници за флаш обекти с връзки към видео клипове. След това ги заменя с <object> елемент, който може да се обработва от приставка за видео клипове. Програмата носи името на старинен прожекционен апарат.

source: Why it exists?
bg: Защо съществува?

source: why it is needed
bg: защо съществува

source: flash disadvantages
bg: flash, недостатъците на флаш

source: free software flash plugins
bg: свободни приставки за флаш

source: html, video
bg: html, видео

source: The short answer: I had spare time and was curious is it going to work.@*
bg: Краткият отговор – имах свободно време и ми беше любопитно дали ще се получи.@*

source: The long answer: Free software flash plugins like Gnash and Swfdec do not work well with video flash players on every site. On top of that:
bg: По-дългият – приставките за флаш Gnash и Swfdec са свободен софтуер, но те не работят добре с флаш обектите за изпълнение на видео клипове на всяка уеб страница. Към това трябва да се добави и:

source: Even with free software plugin you run a lot of proprietary software as ActionScript
bg: Дори със свободни приставки, се изпълнява собственически софтуер под формата на ActionScript

source: Even the free software plugins use too much resources
bg: Дори свободните приставки използват прекалено много ресурси

source: Flash is proprietary technology
bg: Флаш е собственическа (не е общодостъпна) технология

source: Flash is not a web standard
bg: Флаш не е уеб стандарт

source: Most of the flash objects in a page contain useless stuff
bg: По-голямата част от флаш обектите в една страница съдържат безполезни данни

source: Playback of video clips in a browser is technically possible since the existence of the <object> tag (around 1999; maybe even before that?!). To watch a video inside a browser the user always needs a plugin (HTML5 changes that a bit). Why it should be flash plugin?
bg: Изпълнението на видео клипове в браузър е технически възможно, след появата на елемента <object> (около 1999 г.; може би дори преди това?!). За да гледа видео клип в браузър, човек винаги има нужда от приставка (HTML5 малко променя това). Защо това трябва да е приставка за флаш?

source: Most of the time I do not have Gnash or Swfdec installed. I do not care about flash except, sometimes for video clips. I got tired of using Bash/Perl/Python@dots{} scripts to download video clips and watch them. Linterna M@value{AACUTE}gica was born.
bg: През по-голямата част от времето Gnash и Swfdec не са инсталирани на компютъра ми. Не ме вълнува флаш освен в редки случаи заради видео клипове. Изморих се да използвам скриптове написани на Bash/Perl/Python… за да изтеглям клипове и след това да ги гледам. Появи се Linterna Mágica.

source: Who made it?
bg: Кои са авторите?

source: authors
bg: автори

source: Original idea and programming by Ivaylo Valkov.@* Interface design by Anton Katsarov.
bg: Първоначално хрумване и програмиране – Ивайло Вълков.@* Дизайн на интерфейса – Антон Кацаров.

source: How to pronounce Linterna M@value{AACUTE}gica?
bg: Как се произнася Linterna Mágica?

source: pronounce, name
bg: произношение, име

source: pronounce, linterna m@value{AACUTE}gica
bg: произношение, на linterna m@value{AACUTE}gica

source: The name Linterna M@value{AACUTE}gica is in Spanish. The pronunciation in @acronym{IPA} is @value{pronouncelm}. You can also find the answer to that question by playing the Ogg Vorbis file @file{linterna m@value{AACUTE}gica - pronounce.ogg} located in the @file{data} directory.
bg: Името Linterna M@value{AACUTE}gica е на испански език. Произношението изразено чрез @acronym{IPA} е @value{pronouncelm}. Можете също да изслушате файла @file{linterna màgica - pronounce.ogg} във формат Ogg Vorbis, намиращ се в папката @file{data}, за да разберете отговора на този въпрос.

source: Building the userscript::
bg: Компилиране на потребителския скрипт::

source: Installation
bg: Инсталация

source: Building the userscript
bg: Компилиране на потребителския скрипт

source: Since version 0.0.9 of Linterna M@value{AACUTE}gica the userscript have to be build, if you have downloaded the source code tarball. If you do not want to build the script, visit Linterna M@value{AACUTE}gica's web site and download the compiled version of the script, which is ready for installation. To build the userscript you will need the following packages:
bg: От версия 0.0.9 на Linterna Mágica нататък, изходният код трябва да се компилира, за да получите потребителския скрипт. Ако не желаете да компилирате, посетете уеб страницата на Linterna Mágica и изтеглете компилираната версия на скрипта, която е готова за инсталация. За да компилирате потребителския скрипт са Ви необходими следните пакети:

source: To build the userscript, inside a terminal change the directory to the source code directory of Linterna M@value{AACUTE}gica and type:
bg: За да компилирате потребителския скрипт, през терминал отидете в папката, където е изходния код на Linterna Mágica и въведете:

source: If everything went fine, at the end of the building process you should see the following message:
bg: Ако процесът приключи успешно, накрая би трябвало да видите следното съобщение:

source: To remove all the generated files without the userscript, type:
bg: За да премахнете всички създадени файлове без потребителския скрипт, въведете:

source: To remove all the generated files and the userscript file, type:
bg: За да премахнете всички създадени файлове заедно с потребителския скрипт, въведете:

source: First of all install the Greasemonkey extension for your browser and activate it. For Epiphany it is part of the Epiphany-extensions package. For GNU IceCat, Abrowser and other versions of Firefox see the Greasemonkey web page.
bg: Най-напред инсталирайте разширението Greasemonkey за браузъра, който използвате и го включете. За Epiphany то е част от пакета Epiphany-extensions. За версии на Firefox, които са свободен софтуер посетете страницата на разширението Greasemonkey.

source: Probably these extensions are available in your GNU/Linux distribution as a package.
bg: Вероятно тези разширения са достъпни във Вашата дистрибуция на GNU/Линукс като пакети.

source: Second, install the video plugin that you prefer.
bg: После инсталирайте приставката за видео клипове, която предпочитате.

source: If you have downloaded version of the userscript compressed with gzip or bzip2, decompress it to get a copy of the file ready for installation.
bg: Ако сте изтеглили версия на потребителския скрипт архивирана и компресирана с gzip или bzip2, разархивирайте файла, за да получите копие готово за инсталация.

source: Installation from browser::
bg: Инсталация през браузър::

source: Installation from terminal
bg: Инсталация през терминал

source: Installation from browser
bg: Инсталация през браузър

source: Load the path where you downloaded Linterna M@value{AACUTE}gica in your browser:
bg: Въведете в адресното поле на браузъра пътя до папката, където сте изтеглили Linterna M@value{AACUTE}gica:

source: You can also start it from a terminal:
bg: Можете също да го заредите през терминал:

source: or
bg: или

source: Right-click the user script and from the menu select
bg: Натиснете с десния бутон на мишката потребителския скрипт и от менюто изберете:

source: For Epiphany
bg: за Epiphany:

source: ``Install userscript''
bg: „Инсталиране на потребителски скрипт“

source: For GNU IceCat and other free software versions of Firefox
bg: за GNU IceCat и други свободни версии на Firefox:

source: ``View User Script Source''. In the new window click the Greasemonkey ``Install'' button.
bg: „View User Script Source“. В новият прозорец натиснете бутона „Install“.

source: For Midori
bg: за Midori:

source: For Midori version 0.4.0 and above select ``Open Link in Bew Tab''. In the new tab click ``Install user script'' button. Versions before 0.4.0 do not support instala do not support installation of userscripts from the browser.
bg: За версия 0.4.0 и по-нови изберете „Open Link in New Tab“. В новия подпрозорец натиснете бутона „Install user script“. Версиите преди 0.4.0 не поддържат инсталация на потребителски скриптове през браузъра.

source: Another option to install the userscript is to copy it from a terminal.
bg: Друг начин да инсталирате потребителския скрипт, е да го копирате през терминал.

source: For Epiphany:
bg: За Epiphany:

source: For GNU IceCat:
bg: За GNU IceCat:

source: For other free software versions of Firefox:
bg: За други версии на Firefox, които са свободен софтуер:

source: For Midori:
bg: За Midori:

source: configuration
bg: настройки

source: Linterna M@value{AACUTE}gica has some configuration options. The only way (for now) to configure it, is to edit the code of the userscript.
bg: Възможно е да настроите някои от функционалностите на Linterna M@value{AACUTE}gica. Единственият начин (за момента), да направите това е да промените кода на потребителския скрипт.

source: Configuration options::
bg: Възможни настройки::

source: Automatic check for updates::
bg: Автоматична проверка за обновления::

source: Disadvantages of the cookies hack::
bg: Недостатъци на решението с бисквитките::

source: Timed-out background requests::
bg: Забавяне на заявките на заден план::

source: Localisation::
bg: Превод на интерфейса::

source: Stop execution on every site
bg: Спиране на изпълнението на всяка страница

source: Configuration options
bg: Възможни настройки

source: configuration, options
bg: възможни настройки

source: configure
bg: настройване

source: debug, config option
bg: debug, настройка

source: log_to, config option
bg: log_to, настройка

source: updates, config option
bg: updates, настройка

source: priority, config option
bg: priority, настройка

source: autostart, config option
bg: autostart, настройка

source: controls, config option
bg: controls, настройка

source: web controls, config option
bg: уеб бутони, настройка

source: interface, config option
bg: интерфейс, настройка

source: buttons, config option
bg: бутони, настройка

source: locale, config option
bg: locale, настройка

source: cookies, config option
bg: cookies, настройка

source: wait_xhr, config option
bg: wait_xhr, настройка

source: quality, config option
bg: quality, настройка

source: clip quality, config option
bg: качество на видео клипа, настройка

source: To change the configuration of Linterna M@value{AACUTE}gica open the userscript file and look for @code{var linterna_magica_options}. This is a JavaScript object that keeps configuration options in ``option'':''value'' format:
bg: За да промените настройките на Linterna M@value{AACUTE}gica, отворете файла с потребителския скрипт и потърсете за @code{var linterna_magica_options}. Това е програмен обект на езика JavaScript, които съдържа настройките във формат "настройка":"стройност":

source: var linterna_magica_options = @{ "debug": 0, "log_to": "web", "updates": "1w", "priority": "html5, self, plugin", "autostart": "off", "controls": "self", "locale": "auto", "cookies": "restore", "wait_xhr": "off", "quality": "low", @};
bg: var linterna_magica_options = @{ "debug": 0, "log_to": "web", "updates": "1w",n" "priority": "html5, self, plugin", "autostart": "off", "controls": "self",n" "locale": "auto"," "cookies": "restore", "wait_xh": "off", "quality": "low", @};

source: Since version 0.0.10 it is possible to keep your configuration in separate userscript file. This way your preferences will stay intact when new version is installed. The userscript with your configuration must have special structure. If you want this feature, install the file @file{linternamagica_user_condfig.user.js} from the @file{utilities} directory. To change the configuration look for @code{var linterna_magica_user_config}. The format is the same as for the main userscript file. Have in mind that this file is not going to be updated and you will have to add manually new options implemented in future versions, if you don't like the default ones. If an option is missing in this file, the default one provided by the main userscript will be used.
bg: От версия 0.0.10 е възможно да запишете настройките си в отделен потребителски скрипт. По този начин настройките Ви ще се запазят, когато бъде инсталирана нова версия. Потребителският скрипт трябва да има специална структура. Ако искате да използвате тази възможност на Linterna M@value{AACUTE}gica, инсталирайте потребителския скрипт @file{linternamagica_user_condfig.user.js} от папката @file{utilities}. За да промените настройките, потърсете за @code{var linterna_magica_user_config}. Форматът е същият както в основният потребителски скрипт. Имайте предвид, че този файл няма да бъде обновяван. Това означава, че ще трябва самостоятелно да добавяте нови настройки въведени в бъдещи версии, ако не харесвате стандартните им стойности. Ако някоя настройка липсва в този файл, ще се използва стандартната стойност от основния потребителски скрипт.

source: Available options are:
bg: Възможни са следните настройки:

source: This option sets the debug level. The debug information is printed in the console.
bg: Дали в конзолата да се показват съобщения за отстраняване на грешки.

source: Do not print anything (default)
bg: Да не се отпечатват съобщения (стандартно)

source: Print debug information
bg: Да се отпечатват съобщения

source: Where to print the debugging information when debug is not zero.
bg: Къде да се отпечатват съобщенията за отстраняване на грешки, когато debug не е нула.

source: Print messages in the web page (default)
bg: Да се отпечатват в уеб страницата (стандартно)

source: Use the debugging console of the browser
bg: Да се отпечатват в конзолата за грешки на браузъра

source: Should Linterna M@value{AACUTE}gica automatically check and notify for updates. @xref{Automatic check for updates}.
bg: Дали Linterna M@value{AACUTE}gica да проверява и уведомява за нови версии. @xref{Автоматична проверка за обновления}.

source: <time><type>
bg: <време><вид>

source: Check at interval. (default 1w)
bg: Проверка през интервал. (стандартно 1w)

source: <time>
bg: <време>

source: positive integer
bg: цяло положително число

source: <type>
bg: <вид>

source: d = day, w = week, m = month, y = year
bg: d = ден, w = седмица, m = месец, y = година

source: Do not check
bg: Без проверка

source: This options determines how objects found by Linterna M@value{AACUTE}gica should be played. You can set multiple values separated by ``,'', without the quotes. The default value is ``html5, self, plugin''.
bg: Тази настройка определя как да се възпроизвеждат обектите открити от Linterna Mágica. Може да зададете няколко стойности разделени с „ , “ (без кавичките). Стандартната стойност е „html5, self, plugin“.

source: Replace flash and HTML5 objects
bg: Замяна на флаш и HTML5 обектите

source: Use Gnash/Swfdec. A button next to the flash object switches to Linterna M@value{AACUTE}gica.
bg: Ще се използва Gnash/Swfdec. Бутон след флаш обекта включва Linterna Mágica.

source: Use HTML5 player if the site provides one. A button next to the player switches to Linterna M@value{AACUTE}gica.
bg: Клиповете ще се възпроизвеждат чрез HTML5, ако страницата има такава възможност. Бутон след HTML5 елемента включва Linterna Mágica.

source: Auto start playback. If more than one object is found, only the first one will start playback.
bg: Автоматично изпълнение. Ако обектите са няколко, само в първия ще започне изпълнение.

source: Auto start the clip (default)
bg: Автоматично изпълнение на клипа (стандартно)

source: Do not start the clip
bg: Без автоматично изпълнение

source: Buttons for controlling the video
bg: Бутони за управление на клипа

source: Use controls provided by Linterna M@value{AACUTE}gica (default)
bg: Използване на бутоните на Linterna Mágica (стандартно)

source: Use controls provided by the video plugin.
bg: Използване на бутоните на приставката за видео клипове.

source: Interface language
bg: Език на интерфейса

source: Use the language of the browser interface if translation is available (default)
bg: Да се използва езикът на браузъра, ако има наличен превод (стандартно)

source: Set language to lc_CC, where
bg: Да се използва език lc_CC, където

source: language code (lowercase)
bg: код на езика (малки букви)

source: country code (uppercase) Example: en_US, en_UK, bg_BG
bg: код на държавата (главни букви) Пример: en_US, en_UK, bg_BG

source: The way cookies are processed. @xref{Disadvantages of the cookies hack}.
bg: Начинът, по който да се обработват бисквитки. @xref{Недостатъци на решението с бисквитките}.

source: Just delete the cookies.
bg: Бисквитките ще бъдат изтрити.

source: Extract and restore cookies.
bg: Извличане и възстановяване на бисквитки.

source: Timeout before background processing (XHR) starts in milliseconds. 1 s = 1000 ms. If you have problems increase the value. @xref{Timed-out background requests}.
bg: Време за изчакване преди да започне обработката на заден план (XHR) в милисекунди. 1 s = 1000 ms. В случай на проблеми увеличете стойността. @xref{Забавяне на заявките на заден план}.

source: Don't wait (default)
bg: Да не се изчаква (стандартно)

source: <integer>
bg: <цяло число>

source: Wait for <integer> milliseconds.
bg: Да се изчаква <цяло число> милисекунди.

source: Preferred video quality.
bg: Предпочитано качество за видео клиповете

source: Auto-select a link for low/medium/high from the list of links (default low)
bg: Автоматичен избор на връзката за ниско/средно/високо качество (стандартно най-ниско качество – low)

source: <number>
bg: <число>

source: Start the <number> link from the list. If not available the highest quality. Use "1" for lowest quality.
bg: Стартиране на връзката с номер <число> (цяло) от списъка с връзки. Най-високо качество, ако липсва. Използвайте „1“ за най-ниско.

source: <number>%
bg: <число>%

source: Start the link that equals to <number>% in the list. Fractions are accepted - 34.56%, 18,6%.
bg: Стартиране на връзката, която съответства на <число> процента от списъка с връзки. Възможно е да задавате дробни стойности – 34.56%, 18,6%.

source: Automatic check for updates
bg: Автоматична проверка за обновления

source: updates, check for
bg: обновления, проверка за

source: automatic updates, check for
bg: автоматични обновления, проверка за

source: Linterna M@value{AACUTE}gica checks for updates every time the configured interval is reached and at the first and second day after the exact match.
bg: Linterna Mágica проверява за обновления всеки път, когато е достигнат настроеният интервал и допълнително на първия и втория ден след точното съвпадение.

source: Disadvantages of the cookies hack
bg: Недостатъци на решението с бисквитките

source: cookies, disadvantages
bg: бисквитки, недостатъци<

source: A weird hack to get data from YouTube and Dailymotion without cookies is used. With cookies the video link data is garbage for Linterna M@value{AACUTE}gica.
bg: Поддръжката за YouTube и Dailymotion се осъществява по начин избягващ бисквитките. Заявките с бисквитки връщат неизползваеми за Linterna Mágica връзки към видео клипове.
